TexasInstruments/f29h85x-sdk/source/driverlib/ecap.h
typedef enum
{
	ECAP_INPUT_INPUTXBAR1		 = 0,	//!GPIO Input Crossbar output signal-1
	ECAP_INPUT_INPUTXBAR2		 = 1,	//!GPIO Input Crossbar output signal-2
	ECAP_INPUT_INPUTXBAR3		 = 2,	//!GPIO Input Crossbar output signal-3
	ECAP_INPUT_INPUTXBAR4		 = 3,	//!GPIO Input Crossbar output signal-4
	ECAP_INPUT_INPUTXBAR5		 = 4,	//!GPIO Input Crossbar output signal-5
	ECAP_INPUT_INPUTXBAR6		 = 5,	//!GPIO Input Crossbar output signal-6
	ECAP_INPUT_INPUTXBAR7		 = 6,	//!GPIO Input Crossbar output signal-7
	ECAP_INPUT_INPUTXBAR8		 = 7,	//!GPIO Input Crossbar output signal-8
	ECAP_INPUT_INPUTXBAR9		 = 8,	//!GPIO Input Crossbar output signal-9
	ECAP_INPUT_INPUTXBAR10		 = 9,	//!GPIO Input Crossbar output signal-10
	ECAP_INPUT_INPUTXBAR11		 = 10,	//!GPIO Input Crossbar output signal-11
	ECAP_INPUT_INPUTXBAR12		 = 11,	//!GPIO Input Crossbar output signal-12
	ECAP_INPUT_INPUTXBAR13		 = 12,	//!GPIO Input Crossbar output signal-13
	ECAP_INPUT_INPUTXBAR14		 = 13,	//!GPIO Input Crossbar output signal-14
	ECAP_INPUT_INPUTXBAR15		 = 14,	//!GPIO Input Crossbar output signal-15
	ECAP_INPUT_INPUTXBAR16		 = 15,	//!GPIO Input Crossbar output signal-16
	ECAP_INPUT_ECAP1_CLB1_OUT14		 = 16,	//!CLB1 OUT14
	ECAP_INPUT_ECAP2_CLB1_OUT14		 = 16,	//!CLB1 OUT14
	ECAP_INPUT_ECAP1_CLB1_OUT15		 = 17,	//!CLB1 OUT15
	ECAP_INPUT_ECAP2_CLB1_OUT15		 = 17,	//!CLB1 OUT15
	ECAP_INPUT_ECAP3_CLB2_OUT14		 = 16,	//!CLB2 OUT14
	ECAP_INPUT_ECAP4_CLB2_OUT14		 = 16,	//!CLB2 OUT14
	ECAP_INPUT_ECAP5_CLB2_OUT14		 = 16,	//!CLB2 OUT14
	ECAP_INPUT_ECAP3_CLB2_OUT15		 = 17,	//!CLB2 OUT15
	ECAP_INPUT_ECAP4_CLB2_OUT15		 = 17,	//!CLB2 OUT15
	ECAP_INPUT_ECAP5_CLB2_OUT15		 = 17,	//!CLB2 OUT15
	ECAP_INPUT_ECAP6_CLB3_OUT14		 = 16,	//!CLB3 OUT14
	ECAP_INPUT_ECAP6_CLB3_OUT15		 = 17,	//!CLB3 OUT15
	ECAP_INPUT_ECAP6_CLB4_OUT14		 = 18,	//!CLB4 OUT14
	ECAP_INPUT_ECAP6_CLB4_OUT15		 = 19,	//!CLB4 OUT15
	ECAP_INPUT_ECAP1_CLB5_OUT14		 = 18,	//!CLB5 OUT14
	ECAP_INPUT_ECAP2_CLB5_OUT14		 = 18,	//!CLB5 OUT14
	ECAP_INPUT_ECAP1_CLB5_OUT15		 = 19,	//!CLB5 OUT15
	ECAP_INPUT_ECAP2_CLB5_OUT15		 = 19,	//!CLB5 OUT15
	ECAP_INPUT_ECAP3_CLB6_OUT14		 = 18,	//!CLB6 OUT14
	ECAP_INPUT_ECAP4_CLB6_OUT14		 = 18,	//!CLB6 OUT14
	ECAP_INPUT_ECAP5_CLB6_OUT14		 = 18,	//!CLB6 OUT14
	ECAP_INPUT_ECAP3_CLB6_OUT15		 = 19,	//!CLB6 OUT15
	ECAP_INPUT_ECAP4_CLB6_OUT15		 = 19,	//!CLB6 OUT15
	ECAP_INPUT_ECAP5_CLB6_OUT15		 = 19,	//!CLB6 OUT15
	ECAP_INPUT_OUTPUTXBAR1		 = 20,	//!Output Xbar Output-1
	ECAP_INPUT_OUTPUTXBAR2		 = 21,	//!Output Xbar Output-2
	ECAP_INPUT_OUTPUTXBAR3		 = 22,	//!Output Xbar Output-3
	ECAP_INPUT_OUTPUTXBAR4		 = 23,	//!Output Xbar Output-4
	ECAP_INPUT_OUTPUTXBAR5		 = 24,	//!Output Xbar Output-5
	ECAP_INPUT_OUTPUTXBAR6		 = 25,	//!Output Xbar Output-6
	ECAP_INPUT_OUTPUTXBAR7		 = 26,	//!Output Xbar Output-7
	ECAP_INPUT_OUTPUTXBAR8		 = 27,	//!Output Xbar Output-8
	ECAP_INPUT_ADC_E_EVENT4		 = 28,	//!ADCE Event4
	ECAP_INPUT_ADC_E_EVENT3		 = 29,	//!ADCE Event3
	ECAP_INPUT_ADC_E_EVENT2		 = 30,	//!ADCE Event2
	ECAP_INPUT_ADC_E_EVENT1		 = 31,	//!ADCE Event1
	ECAP_INPUT_ADC_D_EVENT4		 = 32,	//!ADCD Event4
	ECAP_INPUT_ADC_D_EVENT3		 = 33,	//!ADCD Event3
	ECAP_INPUT_ADC_D_EVENT2		 = 34,	//!ADCD Event2
	ECAP_INPUT_ADC_D_EVENT1		 = 35,	//!ADCD Event1
	ECAP_INPUT_ADC_C_EVENT4		 = 36,	//!ADCC Event4
	ECAP_INPUT_ADC_C_EVENT3		 = 37,	//!ADCC Event3
	ECAP_INPUT_ADC_C_EVENT2		 = 38,	//!ADCC Event2
	ECAP_INPUT_ADC_C_EVENT1		 = 39,	//!ADCC Event1
	ECAP_INPUT_ADC_B_EVENT4		 = 40,	//!ADCB Event4
	ECAP_INPUT_ADC_B_EVENT3		 = 41,	//!ADCB Event3
	ECAP_INPUT_ADC_B_EVENT2		 = 42,	//!ADCB Event2
	ECAP_INPUT_ADC_B_EVENT1		 = 43,	//!ADCB Event1
	ECAP_INPUT_ADC_A_EVENT4		 = 44,	//!ADCA Event4
	ECAP_INPUT_ADC_A_EVENT3		 = 45,	//!ADCA Event3
	ECAP_INPUT_ADC_A_EVENT2		 = 46,	//!ADCA Event2
	ECAP_INPUT_ADC_A_EVENT1		 = 47,	//!ADCA Event1
	ECAP_INPUT_FSIA_RX_MSR_LINE		 = 48,	//!FSIA Rx MSR Line
	ECAP_INPUT_FSIA_RX_MSR_LINE_RISE		 = 49,	//!FSIA Rx MSR Line Rise
	ECAP_INPUT_FSIA_RX_MSR_LINE_FALL		 = 50,	//!FSIA Rx MSR Line Fall
	ECAP_INPUT_FSIB_RX_MSR_LINE		 = 51,	//!FSIB Rx MSR Line
	ECAP_INPUT_FSIB_RX_MSR_LINE_RISE		 = 52,	//!FSIB Rx MSR Line Rise
	ECAP_INPUT_FSIB_RX_MSR_LINE_FALL		 = 53,	//!FSIB Rx MSR Line Fall
	ECAP_INPUT_FSIC_RX_MSR_LINE		 = 54,	//!FSIC Rx MSR Line
	ECAP_INPUT_FSIC_RX_MSR_LINE_RISE		 = 55,	//!FSIC Rx MSR Line Rise
	ECAP_INPUT_FSIC_RX_MSR_LINE_FALL		 = 56,	//!FSIC Rx MSR Line Fall
	ECAP_INPUT_FSID_RX_MSR_LINE		 = 57,	//!FSID Rx MSR Line
	ECAP_INPUT_FSID_RX_MSR_LINE_RISE		 = 58,	//!FSID Rx MSR Line Rise
	ECAP_INPUT_FSID_RX_MSR_LINE_FALL		 = 59,	//!FSID Rx MSR Line Fall
	ECAP_INPUT_SDFM2_FLT1_COMPARE_LOW		 = 60,	//!SDFM-2 Filter-1 Compare Low Trip
	ECAP_INPUT_SDFM2_FLT2_COMPARE_LOW		 = 61,	//!SDFM-2 Filter-2 Compare Low Trip
	ECAP_INPUT_SDFM2_FLT3_COMPARE_LOW		 = 62,	//!SDFM-2 Filter-3 Compare Low Trip
	ECAP_INPUT_SDFM2_FLT4_COMPARE_LOW		 = 63,	//!SDFM-2 Filter-4 Compare Low Trip
	ECAP_INPUT_SDFM1_FLT1_COMPARE_LOW		 = 64,	//!SDFM-1 Filter-1 Compare Low Trip
	ECAP_INPUT_SDFM1_FLT2_COMPARE_LOW		 = 65,	//!SDFM-1 Filter-2 Compare Low Trip
	ECAP_INPUT_SDFM1_FLT3_COMPARE_LOW		 = 66,	//!SDFM-1 Filter-3 Compare Low Trip
	ECAP_INPUT_SDFM1_FLT4_COMPARE_LOW		 = 67,	//!SDFM-1 Filter-4 Compare Low Trip
	ECAP_INPUT_SDFM2_FLT1_COMPARE_Z		 = 68,	//!SDFM-2 Filter-1 Compare Z Trip
	ECAP_INPUT_SDFM2_FLT2_COMPARE_Z		 = 69,	//!SDFM-2 Filter-2 Compare Low Trip
	ECAP_INPUT_SDFM2_FLT3_COMPARE_Z		 = 70,	//!SDFM-2 Filter-3 Compare Low Trip
	ECAP_INPUT_SDFM2_FLT4_COMPARE_Z		 = 71,	//!SDFM-2 Filter-4 Compare Low Trip
	ECAP_INPUT_SDFM1_FLT1_COMPARE_Z		 = 72,	//!SDFM-1 Filter-1 Compare Z Trip
	ECAP_INPUT_SDFM1_FLT2_COMPARE_Z		 = 73,	//!SDFM-1 Filter-2 Compare Low Trip
	ECAP_INPUT_SDFM1_FLT3_COMPARE_Z		 = 74,	//!SDFM-1 Filter-3 Compare Low Trip
	ECAP_INPUT_SDFM1_FLT4_COMPARE_Z		 = 75,	//!SDFM-1 Filter-4 Compare Low Trip
	ECAP_INPUT_SDFM2_FLT1_COMPARE_HIGH		 = 76,	//!SDFM-2 Filter-1 Compare High Trip
	ECAP_INPUT_SDFM2_FLT2_COMPARE_HIGH		 = 77,	//!SDFM-2 Filter-2 Compare High Trip
	ECAP_INPUT_SDFM2_FLT3_COMPARE_HIGH		 = 78,	//!SDFM-2 Filter-3 Compare High Trip
	ECAP_INPUT_SDFM2_FLT4_COMPARE_HIGH		 = 79,	//!SDFM-2 Filter-4 Compare High Trip
	ECAP_INPUT_SDFM1_FLT1_COMPARE_HIGH		 = 80,	//!SDFM-1 Filter-1 Compare High Trip
	ECAP_INPUT_SDFM1_FLT2_COMPARE_HIGH		 = 81,	//!SDFM-1 Filter-2 Compare High Trip
	ECAP_INPUT_SDFM1_FLT3_COMPARE_HIGH		 = 82,	//!SDFM-1 Filter-3 Compare High Trip
	ECAP_INPUT_SDFM1_FLT4_COMPARE_HIGH		 = 83,	//!SDFM-1 Filter-4 Compare High Trip
	ECAP_INPUT_SDFM2_FLT1_COMPARE_HIGH_OR_LOW		 = 84,	//!SDFM-2 Filter-1 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM2_FLT2_COMPARE_HIGH_OR_LOW		 = 85,	//!SDFM-2 Filter-2 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM2_FLT3_COMPARE_HIGH_OR_LOW		 = 86,	//!SDFM-2 Filter-3 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM2_FLT4_COMPARE_HIGH_OR_LOW		 = 87,	//!SDFM-2 Filter-4 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM1_FLT1_COMPARE_HIGH_OR_LOW		 = 88,	//!SDFM-1 Filter-1 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM1_FLT2_COMPARE_HIGH_OR_LOW		 = 89,	//!SDFM-1 Filter-2 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM1_FLT3_COMPARE_HIGH_OR_LOW		 = 90,	//!SDFM-1 Filter-3 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM1_FLT4_COMPARE_HIGH_OR_LOW		 = 91,	//!SDFM-1 Filter-4 Compare High Trip or Low Trip
	ECAP_INPUT_ECAP5_ECAP6_DELAY_CLK		 = 92,	//!Delay clock for measurement
	ECAP_INPUT_ECAP6_ECAP5_DELAY_CLK		 = 93,	//!Delay clock for measurement
	ECAP_INPUT_ECATSYNC0		 = 94,	//!Ethercat Sync0
	ECAP_INPUT_ECATSYNC1		 = 95,	//!Ethercat Sync1
	ECAP_INPUT_CMPSS1_CTRIP_LOW		 = 96,	//!Compare Subsystem-1 Low Trip
	ECAP_INPUT_CMPSS2_CTRIP_LOW		 = 97,	//!Compare Subsystem-2 Low Trip
	ECAP_INPUT_CMPSS3_CTRIP_LOW		 = 98,	//!Compare Subsystem-3 Low Trip
	ECAP_INPUT_CMPSS4_CTRIP_LOW		 = 99,	//!Compare Subsystem-4 Low Trip
	ECAP_INPUT_CMPSS5_CTRIP_LOW		 = 100,	//!Compare Subsystem-5 Low Trip
	ECAP_INPUT_CMPSS6_CTRIP_LOW		 = 101,	//!Compare Subsystem-6 Low Trip
	ECAP_INPUT_CMPSS7_CTRIP_LOW		 = 102,	//!Compare Subsystem-7 Low Trip
	ECAP_INPUT_CMPSS8_CTRIP_LOW		 = 103,	//!Compare Subsystem-8 Low Trip
	ECAP_INPUT_CMPSS1_CTRIP_HIGH		 = 107,	//!Compare Subsystem-1 High Trip
	ECAP_INPUT_CMPSS2_CTRIP_HIGH		 = 108,	//!Compare Subsystem-2 High Trip
	ECAP_INPUT_CMPSS3_CTRIP_HIGH		 = 109,	//!Compare Subsystem-3 High Trip
	ECAP_INPUT_CMPSS4_CTRIP_HIGH		 = 110,	//!Compare Subsystem-4 High Trip
	ECAP_INPUT_CMPSS5_CTRIP_HIGH		 = 111,	//!Compare Subsystem-5 High Trip
	ECAP_INPUT_CMPSS6_CTRIP_HIGH		 = 112,	//!Compare Subsystem-6 High Trip
	ECAP_INPUT_CMPSS7_CTRIP_HIGH		 = 113,	//!Compare Subsystem-7 High Trip
	ECAP_INPUT_CMPSS8_CTRIP_HIGH		 = 114,	//!Compare Subsystem-8 High Trip
	ECAP_INPUT_GPIO8		 = 115,	//!GPIO8
	ECAP_INPUT_GPIO9		 = 116,	//!GPIO9
	ECAP_INPUT_GPIO22		 = 117,	//!GPIO22
	ECAP_INPUT_GPIO23		 = 118,	//!GPIO23
	ECAP_INPUT_CMPSS1_CTRIP_HIGH_OR_LOW		 = 119,	//!Compare Subsystem-1 High Trip or Low Trip
	ECAP_INPUT_CMPSS2_CTRIP_HIGH_OR_LOW		 = 120,	//!Compare Subsystem-1 High Trip or Low Trip
	ECAP_INPUT_CMPSS3_CTRIP_HIGH_OR_LOW		 = 121,	//!Compare Subsystem-2 High Trip or Low Trip
	ECAP_INPUT_CMPSS4_CTRIP_HIGH_OR_LOW		 = 122,	//!Compare Subsystem-3 High Trip or Low Trip
	ECAP_INPUT_CMPSS5_CTRIP_HIGH_OR_LOW		 = 123,	//!Compare Subsystem-4 High Trip or Low Trip
	ECAP_INPUT_CMPSS6_CTRIP_HIGH_OR_LOW		 = 124,	//!Compare Subsystem-5 High Trip or Low Trip
	ECAP_INPUT_CMPSS7_CTRIP_HIGH_OR_LOW		 = 125,	//!Compare Subsystem-6 High Trip or Low Trip
	ECAP_INPUT_CMPSS8_CTRIP_HIGH_OR_LOW		 = 126,	//!Compare Subsystem-7 High Trip or Low Trip
	ECAP_INPUT_ECAP1_INPUTXBAR7		 = 127,	//!GPIO Input Crossbar output signal-7
	ECAP_INPUT_ECAP2_INPUTXBAR8		 = 127,	//!GPIO Input Crossbar output signal-8
	ECAP_INPUT_ECAP3_INPUTXBAR9		 = 127,	//!GPIO Input Crossbar output signal-9
	ECAP_INPUT_ECAP4_INPUTXBAR10		 = 127,	//!GPIO Input Crossbar output signal-10
	ECAP_INPUT_ECAP5_INPUTXBAR11		 = 127,	//!GPIO Input Crossbar output signal-11
	ECAP_INPUT_ECAP6_INPUTXBAR12		 = 127,	//!GPIO Input Crossbar output signal-12
	ECAP_INPUT_SDFM4_FLT1_COMPARE_LOW		 = 128,	//!SDFM-4 Filter-1 Compare Low Trip
	ECAP_INPUT_SDFM4_FLT2_COMPARE_LOW		 = 129,	//!SDFM-4 Filter-2 Compare Low Trip
	ECAP_INPUT_SDFM4_FLT3_COMPARE_LOW		 = 130,	//!SDFM-4 Filter-3 Compare Low Trip
	ECAP_INPUT_SDFM4_FLT4_COMPARE_LOW		 = 131,	//!SDFM-4 Filter-4 Compare Low Trip
	ECAP_INPUT_SDFM3_FLT1_COMPARE_LOW		 = 132,	//!SDFM-3 Filter-1 Compare Low Trip
	ECAP_INPUT_SDFM3_FLT2_COMPARE_LOW		 = 133,	//!SDFM-3 Filter-2 Compare Low Trip
	ECAP_INPUT_SDFM3_FLT3_COMPARE_LOW		 = 134,	//!SDFM-3 Filter-3 Compare Low Trip
	ECAP_INPUT_SDFM3_FLT4_COMPARE_LOW		 = 135,	//!SDFM-3 Filter-4 Compare Low Trip
	ECAP_INPUT_SDFM4_FLT4_COMPARE_Z		 = 139,	//!SDFM-4 Filter-4 Compare Z Trip
	ECAP_INPUT_SDFM3_FLT4_COMPARE_Z		 = 143,	//!SDFM-3 Filter-4 Compare Z Trip
	ECAP_INPUT_SDFM4_FLT1_COMPARE_HIGH		 = 144,	//!SDFM-4 Filter-1 Compare High Trip
	ECAP_INPUT_SDFM4_FLT2_COMPARE_HIGH		 = 145,	//!SDFM-4 Filter-2 Compare High Trip
	ECAP_INPUT_SDFM4_FLT3_COMPARE_HIGH		 = 146,	//!SDFM-4 Filter-3 Compare High Trip
	ECAP_INPUT_SDFM4_FLT4_COMPARE_HIGH		 = 147,	//!SDFM-4 Filter-4 Compare High Trip
	ECAP_INPUT_SDFM3_FLT1_COMPARE_HIGH		 = 148,	//!SDFM-3 Filter-1 Compare High Trip
	ECAP_INPUT_SDFM3_FLT2_COMPARE_HIGH		 = 149,	//!SDFM-3 Filter-2 Compare High Trip
	ECAP_INPUT_SDFM3_FLT3_COMPARE_HIGH		 = 150,	//!SDFM-3 Filter-3 Compare High Trip
	ECAP_INPUT_SDFM3_FLT4_COMPARE_HIGH		 = 151,	//!SDFM-3 Filter-4 Compare High Trip
	ECAP_INPUT_SDFM4_FLT1_COMPARE_HIGH_OR_LOW		 = 152,	//!SDFM-4 Filter-1 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM4_FLT2_COMPARE_HIGH_OR_LOW		 = 153,	//!SDFM-4 Filter-2 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM4_FLT3_COMPARE_HIGH_OR_LOW		 = 154,	//!SDFM-4 Filter-3 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM4_FLT4_COMPARE_HIGH_OR_LOW		 = 155,	//!SDFM-4 Filter-4 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM3_FLT1_COMPARE_HIGH_OR_LOW		 = 156,	//!SDFM-3 Filter-1 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM3_FLT2_COMPARE_HIGH_OR_LOW		 = 157,	//!SDFM-3 Filter-2 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM3_FLT3_COMPARE_HIGH_OR_LOW		 = 158,	//!SDFM-3 Filter-3 Compare High Trip or Low Trip
	ECAP_INPUT_SDFM3_FLT4_COMPARE_HIGH_OR_LOW		 = 159,	//!SDFM-3 Filter-4 Compare High Trip or Low Trip
	ECAP_INPUT_EPWM18_DEL_ACTIVE		 = 160,	//!EPWM-18 Diode Emulation Logic Active
	ECAP_INPUT_EPWM17_DEL_ACTIVE		 = 161,	//!EPWM-17 Diode Emulation Logic Active
	ECAP_INPUT_EPWM16_DEL_ACTIVE		 = 162,	//!EPWM-16 Diode Emulation Logic Active
	ECAP_INPUT_EPWM15_DEL_ACTIVE		 = 163,	//!EPWM-15 Diode Emulation Logic Active
	ECAP_INPUT_EPWM14_DEL_ACTIVE		 = 164,	//!EPWM-14 Diode Emulation Logic Active
	ECAP_INPUT_EPWM13_DEL_ACTIVE		 = 165,	//!EPWM-13 Diode Emulation Logic Active
	ECAP_INPUT_EPWM12_DEL_ACTIVE		 = 166,	//!EPWM-12 Diode Emulation Logic Active
	ECAP_INPUT_EPWM11_DEL_ACTIVE		 = 167,	//!EPWM-11 Diode Emulation Logic Active
	ECAP_INPUT_EPWM10_DEL_ACTIVE		 = 168,	//!EPWM-10 Diode Emulation Logic Active
	ECAP_INPUT_EPWM9_DEL_ACTIVE		 = 169,	//!EPWM-9 Diode Emulation Logic Active
	ECAP_INPUT_EPWM8_DEL_ACTIVE		 = 170,	//!EPWM-8 Diode Emulation Logic Active
	ECAP_INPUT_EPWM7_DEL_ACTIVE		 = 171,	//!EPWM-7 Diode Emulation Logic Active
	ECAP_INPUT_EPWM6_DEL_ACTIVE		 = 172,	//!EPWM-6 Diode Emulation Logic Active
	ECAP_INPUT_EPWM5_DEL_ACTIVE		 = 173,	//!EPWM-5 Diode Emulation Logic Active
	ECAP_INPUT_EPWM4_DEL_ACTIVE		 = 174,	//!EPWM-4 Diode Emulation Logic Active
	ECAP_INPUT_EPWM3_DEL_ACTIVE		 = 175,	//!EPWM-3 Diode Emulation Logic Active
	ECAP_INPUT_EPWM2_DEL_ACTIVE		 = 176,	//!EPWM-2 Diode Emulation Logic Active
	ECAP_INPUT_EPWM1_DEL_ACTIVE		 = 177,	//!EPWM-1 Diode Emulation Logic Active
	ECAP_INPUT_GPIO11		 = 251,	//!GPIO11
	ECAP_INPUT_GPIO12		 = 252,	//!GPIO12
	ECAP_INPUT_GPIO13		 = 253,	//!GPIO13
	ECAP_INPUT_GPIO14		 = 254,	//!GPIO14
	ECAP_INPUT_ECAP1_EPG1_DATAOUT49		 = 255,	//!EPG-1 Data Output-49 Connection
	ECAP_INPUT_ECAP2_EPG1_DATAOUT50		 = 255,	//!EPG-1 Data Output-50 Connection
	ECAP_INPUT_ECAP3_EPG1_DATAOUT51		 = 255,	//!EPG-1 Data Output-51 Connection
	ECAP_INPUT_ECAP4_EPG1_DATAOUT52		 = 255,	//!EPG-1 Data Output-52 Connection
	ECAP_INPUT_ECAP5_EPG1_DATAOUT53		 = 255,	//!EPG-1 Data Output-53 Connection
	ECAP_INPUT_ECAP6_EPG1_DATAOUT54		 = 255	//!EPG-1 Data Output-54 Connection
} ECAP_InputCaptureSignals;


//*****************************************************************************
//
//! Values that can be passed to ECAP_selectQualPeriod() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! Bypass
    ECAP_PULSE_WIDTH_FILTER_BYPASS         = 0x0,
    //! Pulse width less than 1 cycle
    ECAP_PULSE_WIDTH_FILTER_CYCLE1         = 0x1,
    //! Pulse width less than 2 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE2         = 0x2,
    //! Pulse width less than 3 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE3         = 0x3,
    //! Pulse width less than 4 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE4         = 0x4,
    //! Pulse width less than 5 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE5         = 0x5,
    //! Pulse width less than 6 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE6         = 0x6,
    //! Pulse width less than 7 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE7         = 0x7,
    //! Pulse width less than 8 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE8         = 0x8,
    //! Pulse width less than 9 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE9         = 0x9,
    //! Pulse width less than 10 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE10        = 0xA,
    //! Pulse width less than 11 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE11        = 0xB,
    //! Pulse width less than 12 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE12        = 0xC,
    //! Pulse width less than 13 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE13        = 0xD,
    //! Pulse width less than 14 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE14        = 0xE,
    //! Pulse width less than 15 cycles
    ECAP_PULSE_WIDTH_FILTER_CYCLE15        = 0xF,
}ECAP_QualPeriodSelect;

//*****************************************************************************
//
//! Values that can be passed to ECAP_setSyncInPulseSource() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! Disable Sync-in
    ECAP_SYNC_IN_PULSE_SRC_DISABLE         = 0x0,
    //! Sync-in source is EPWM1 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM1   = 0x1,
    //! Sync-in source is EPWM2 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM2   = 0x2,
    //! Sync-in source is EPWM3 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM3   = 0x3,
    //! Sync-in source is EPWM4 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4   = 0x4,
    //! Sync-in source is EPWM5 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM5   = 0x5,
    //! Sync-in source is EPWM6 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM6   = 0x6,
    //! Sync-in source is EPWM7 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM7   = 0x7,
    //! Sync-in source is EPWM8 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM8   = 0x8,
    //! Sync-in source is EPWM9 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM9   = 0x9,
    //! Sync-in source is EPWM10 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM10  = 0xA,
    //! Sync-in source is EPWM11 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM11  = 0xB,
    //! Sync-in source is EPWM12 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM12  = 0xC,
    //! Sync-in source is EPWM13 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM13  = 0xD,
    //! Sync-in source is EPWM14 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM14  = 0xE,
    //! Sync-in source is EPWM15 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM15  = 0xF,
    //! Sync-in source is EPWM16 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM16  = 0x10,
    //! Sync-in source is ECAP1 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_ECAP1   = 0x11,
    //! Sync-in source is ECAP2 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_ECAP2   = 0x12,
    //! Sync-in source is ECAP3 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_ECAP3   = 0x13,
    //! Sync-in source is ECAP4 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_ECAP4   = 0x14,
    //! Sync-in source is ECAP5 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_ECAP5   = 0x15,
    //! Sync-in source is ECAP6 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_ECAP6   = 0x16,
    //! Sync-in source is Input XBAR out5 signal
    ECAP_SYNC_IN_PULSE_SRC_INPUTXBAR_OUT5 = 0x18,
    //! Sync-in source is Input XBAR out6 signal
    ECAP_SYNC_IN_PULSE_SRC_INPUTXBAR_OUT6 = 0x19,
    //! Sync-in source is Ethercat sync0 signal
    ECAP_SYNC_IN_PULSE_SRC_ETHERCAT_SYNC0 = 0x1A,
    //! Sync-in source is Ethercat sync1 signal
    ECAP_SYNC_IN_PULSE_SRC_ETHERCAT_SYNC1 = 0x1B,
    //! Sync-in source is EPWM17 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM17  = 0x1C,
    //! Sync-in source is EPWM18 sync-out signal
    ECAP_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM18  = 0x1D,
    //! Sync-in source is FSI RXA RX signal
    ECAP_SYNC_IN_PULSE_SRC_FSIRXA_RX_TRIG1 = 0x1E,
    //! Sync-in source is FSI RXB RX signal
    ECAP_SYNC_IN_PULSE_SRC_FSIRXB_RX_TRIG1 = 0x1F,
    //! Sync-in source is FSI RXC RX signal
    ECAP_SYNC_IN_PULSE_SRC_FSIRXC_RX_TRIG1 = 0x20,
    //! Sync-in source is FSI RXD RX signal
    ECAP_SYNC_IN_PULSE_SRC_FSIRXD_RX_TRIG1 = 0x21,
}ECAP_SyncInPulseSource;

//*****************************************************************************
//
// Values that can be passed to ECAP Signal Monitoring APIs
//
//*****************************************************************************
//! ECAP Monitoring Unit 1
#define ECAP_MONITORING_UNIT_1       0U
//! ECAP Monitoring Unit 2
#define ECAP_MONITORING_UNIT_2       1U

//*****************************************************************************
//
//! Values that can be passed to ECAP_setupEarlyMaxErrorCheck() as the
//! \e checkError parameter.
//
//*****************************************************************************
//! Max error generated when pulse width cross max value
#define ECAP_PULSE_WIDTH_CROSS_MAX_VALUE     0U
//! Max error generated when second event has occured
#define ECAP_SECOND_EVENT_OCCURED            1U

//*****************************************************************************
//
//! Values that can be passed to ECAP_selectShadowLoadMode() as the
//! \e loadMode parameter.
//
//*****************************************************************************
//! Load on next sync event
#define ECAP_ACTIVE_LOAD_SYNC_EVT            0U
//! Load on EPWM GLDLCSTRB event
#define ECAP_ACTIVE_LOAD_GLDLCSTRB_EVT       1U

//*****************************************************************************
//
//! Values that can be passed to ECAP_selectMonitoringType() as the
//! \e monSel parameter.
//
//*****************************************************************************
typedef enum
{
    //! High Pulse Width
    ECAP_MUNIT_HIGH_PULSE_WIDTH = 0U,
    //! Low Pulse Width
    ECAP_MUNIT_LOW_PULSE_WIDTH = 1U,
    //! Period width from rise to rise
    ECAP_MUNIT_PERIOD_WIDTH_RISE_RISE = 2U,
    //! Period width from fall to fall
    ECAP_MUNIT_PERIOD_WIDTH_FALL_FALL = 3U,
    //! Monitor rise edge
    ECAP_MUNIT_MONITOR_RISE_EDGE = 4U,
    //! Monitor fall edge
    ECAP_MUNIT_MONITOR_FALL_EDGE = 5U,
}ECAP_MonitoringTypeSelect;

