TexasInstruments/f29h85x-sdk/source/driverlib/ecap.h
//*****************************************************************************
//
//! Values that can be passed to ECAP_selectTripSignal() &
//! ECAP_selectGlobalLoadStrobe() as the \e tripSel and \e strobe parameter.
//
//*****************************************************************************
typedef enum
{
    //! Disabled
    ECAP_MUNIT_TRIP_DISABLED = 0U,
    //! MUNIT trip source is PWMXBAR-A output 0
    ECAP_MUNIT_TRIP_EPWM_XBARA_OUT0 = 1U,
    //! MUNIT trip source is PWMXBAR-A output 1
    ECAP_MUNIT_TRIP_EPWM_XBARA_OUT1 = 2U,
    //! MUNIT trip source is PWMXBAR-A output 2
    ECAP_MUNIT_TRIP_EPWM_XBARA_OUT2 = 3U,
    //! MUNIT trip source is PWMXBAR-A output 3
    ECAP_MUNIT_TRIP_EPWM_XBARA_OUT3 = 4U,
    //! MUNIT trip source is PWMXBAR-A output 4
    ECAP_MUNIT_TRIP_EPWM_XBARA_OUT4 = 5U,
    //! MUNIT trip source is PWMXBAR-A output 5
    ECAP_MUNIT_TRIP_EPWM_XBARA_OUT5 = 6U,
    //! MUNIT trip source is PWMXBAR-A output 6
    ECAP_MUNIT_TRIP_EPWM_XBARA_OUT6 = 7U,
    //! MUNIT trip source is PWMXBAR-A output 7
    ECAP_MUNIT_TRIP_EPWM_XBARA_OUT7 = 8U,
    //! MUNIT trip source is PWMXBAR-B output 0
    ECAP_MUNIT_TRIP_EPWM_XBARB_OUT0 = 9U,
    //! MUNIT trip source is PWMXBAR-B output 1
    ECAP_MUNIT_TRIP_EPWM_XBARB_OUT1 = 10U,
    //! MUNIT trip source is PWMXBAR-B output 2
    ECAP_MUNIT_TRIP_EPWM_XBARB_OUT2 = 11U,
    //! MUNIT trip source is PWMXBAR-B output 3
    ECAP_MUNIT_TRIP_EPWM_XBARB_OUT3 = 12U,
    //! MUNIT trip source is PWMXBAR-B output 4
    ECAP_MUNIT_TRIP_EPWM_XBARB_OUT4 = 13U,
    //! MUNIT trip source is PWMXBAR-B output 5
    ECAP_MUNIT_TRIP_EPWM_XBARB_OUT5 = 14U,
    //! MUNIT trip source is PWMXBAR-B output 6
    ECAP_MUNIT_TRIP_EPWM_XBARB_OUT6 = 15U,
    //! MUNIT trip source is PWMXBAR-B output 7
    ECAP_MUNIT_TRIP_EPWM_XBARB_OUT7 = 16U,
    //! MUNIT trip source is EPWM1 trip out signal
    ECAP_MUNIT_TRIP_EPWM1_TRIPOUT = 32U,
    //! MUNIT trip source is EPWM2 trip out signal
    ECAP_MUNIT_TRIP_EPWM2_TRIPOUT = 33U,
    //! MUNIT trip source is EPWM3 trip out signal
    ECAP_MUNIT_TRIP_EPWM3_TRIPOUT = 34U,
    //! MUNIT trip source is EPWM4 trip out signal
    ECAP_MUNIT_TRIP_EPWM4_TRIPOUT = 35U,
    //! MUNIT trip source is EPWM5 trip out signal
    ECAP_MUNIT_TRIP_EPWM5_TRIPOUT = 36U,
    //! MUNIT trip source is EPWM6 trip out signal
    ECAP_MUNIT_TRIP_EPWM6_TRIPOUT = 37U,
    //! MUNIT trip source is EPWM7 trip out signal
    ECAP_MUNIT_TRIP_EPWM7_TRIPOUT = 38U,
    //! MUNIT trip source is EPWM8 trip out signal
    ECAP_MUNIT_TRIP_EPWM8_TRIPOUT = 39U,
    //! MUNIT trip source is EPWM9 trip out signal
    ECAP_MUNIT_TRIP_EPWM9_TRIPOUT = 40U,
    //! MUNIT trip source is EPWM10 trip out signal
    ECAP_MUNIT_TRIP_EPWM10_TRIPOUT = 41U,
    //! MUNIT trip source is EPWM11 trip out signal
    ECAP_MUNIT_TRIP_EPWM11_TRIPOUT = 42U,
    //! MUNIT trip source is EPWM12 trip out signal
    ECAP_MUNIT_TRIP_EPWM12_TRIPOUT = 43U,
    //! MUNIT trip source is EPWM13 trip out signal
    ECAP_MUNIT_TRIP_EPWM13_TRIPOUT = 44U,
    //! MUNIT trip source is EPWM14 trip out signal
    ECAP_MUNIT_TRIP_EPWM14_TRIPOUT = 45U,
    //! MUNIT trip source is EPWM15 trip out signal
    ECAP_MUNIT_TRIP_EPWM15_TRIPOUT = 46U,
    //! MUNIT trip source is EPWM16 trip out signal
    ECAP_MUNIT_TRIP_EPWM16_TRIPOUT = 47U,
    //! MUNIT trip source is EPWM17 trip out signal
    ECAP_MUNIT_TRIP_EPWM17_TRIPOUT = 48U,
    //! MUNIT trip source is EPWM18 trip out signal
    ECAP_MUNIT_TRIP_EPWM18_TRIPOUT = 49U
}ECAP_MunitTripInputSelect;

//*****************************************************************************
//
//! \internal
//! Checks eCAP base address.
//!
//! \param base specifies the eCAP module base address.
//!
//! This function determines if an eCAP module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool ECAP_isBaseValid(uint32_t base)
{
    return(
           ((base & BASE_ADDR_MASK) == ECAP1_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP2_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP3_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP4_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP5_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP6_BASE_FRAME(0U))
          );
}
#endif

//*****************************************************************************
//
//! \internal
//! Checks eCAP Signal Monitoring base address.
//!
//! \param base specifies the eCAP Signal Monitoring module base address.
//!
//! This function determines if an eCAP Signal Monitoring
//! module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool ECAP_isSignalMonitoringBaseValid(uint32_t base)
{
    return(
           ((base & BASE_ADDR_MASK) == ECAP1SIGNALMONITORING_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP2SIGNALMONITORING_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP3SIGNALMONITORING_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP4SIGNALMONITORING_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP5SIGNALMONITORING_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ECAP6SIGNALMONITORING_BASE_FRAME(0U))
          );
}
#endif
//*****************************************************************************
//
//! Sets the input prescaler.
//!
//! \param base is the base address of the ECAP module.
//! \param preScalerValue is the pre scaler value for ECAP input
//!
//! This function divides the ECAP input scaler. The pre scale value is
//! doubled inside the module. For example a preScalerValue of 5 will divide
//! the scaler by 10. Use a value of 1 to divide the pre scaler by 1.
//! The \e preScalerValue should be less than \b ECAP_MAX_PRESCALER_VALUE.
//!
//! \return None.
//
//*****************************************************************************
static inline void ECAP_setEventPrescaler(uint32_t base,
                                          uint16_t preScalerValue)
{
    ASSERT(ECAP_isBaseValid(base));

