TexasInstruments/f29h85x-sdk/source/driverlib/ecap.h
    ASSERT(ECAP_isBaseValid(base));


    switch(event)
    {
        case ECAP_EVENT_1:

            //
            // Read CAP1 register
            //
            count = HWREG(base + ECAP_O_CAP1);
        break;

        case ECAP_EVENT_2:
            //
            // Read CAP2 register
            //
            count = HWREG(base + ECAP_O_CAP2);
        break;

        case ECAP_EVENT_3:

            //
            // Read CAP3 register
            //
            count = HWREG(base + ECAP_O_CAP3);
        break;

        case ECAP_EVENT_4:

            //
            // Read CAP4 register
            //
            count = HWREG(base + ECAP_O_CAP4);
        break;

        default:

            //
            // Invalid event parameter
            //
            count = 0U;
        break;
    }

    return(count);
}
//*****************************************************************************
//
//! Select eCAP input.
//!
//! \param base is the base address of the ECAP module.
//! \param input is the eCAP input signal.
//!
//! This function selects the eCAP input signal.
//!
//! Please refer to the ::ECAP_InputCaptureSignals Enum for the valid values
//! to be passed to \e input parameter.
//!
//! \return None.
//
//*****************************************************************************
static inline void ECAP_selectECAPInput(uint32_t base,
                                        ECAP_InputCaptureSignals input)
{
    ASSERT(ECAP_isBaseValid(base));

    //
    // Write to ECCTL0
    //
    HWREGH(base + ECAP_O_ECCTL0) =
                ((HWREGH(base + ECAP_O_ECCTL0) & ~ECAP_ECCTL0_INPUTSEL_M) |
                 (uint16_t)input);
}
//*****************************************************************************
//
//! Select qualification period to filter out noise
//!
//! \param base is the base address of the ECAP module.
//! \param width is the pulse width below which the pulse
//!              will be filtered out.
//!
//! This function selects the qualification period to filter out pulses with
//! width less than the mentioned number of cycles.
//!
//! Please refer to the ::ECAP_QualPeriodSelect Enum for the valid values
//! to be passed to \e width parameter.
//!
//! \return None.
//
//*****************************************************************************
static inline void ECAP_selectQualPeriod(uint32_t base,
                                         ECAP_QualPeriodSelect width)
{
    ASSERT(ECAP_isBaseValid(base));

    //
    // Write to ECCTL0 - Qualification Period
    //
    HWREGH(base + ECAP_O_ECCTL0) =
               ((HWREGH(base + ECAP_O_ECCTL0) & ~ECAP_ECCTL0_QUALPRD_M) |
                ((uint32_t)width << ECAP_ECCTL0_QUALPRD_S));
}

//*****************************************************************************
//
//! Sets the eCAP SOC trigger source.
//!
//! \param base is the base address of the ECAP module.
//! \param event is the eCAP event for the SOC trigger
//!
//! This function sets the eCAP event source in capture mode and APWM mode
//! for the SOC trigger trigger.
//! Valid values for \e event are \b ECAP_EVENT_1 to \b ECAP_EVENT_4.
//!
//! In capture mode of operation -
//! \b ECAP_EVENT_1 - SOC trigger interrupt source is CEVT1
//! \b ECAP_EVENT_2 - SOC trigger interrupt source is CEVT2
//! \b ECAP_EVENT_3 - SOC trigger interrupt source is CEVT3
//! \b ECAP_EVENT_4 - SOC trigger interrupt source is CEVT4
//!
//! In APWM mode of operation -
//! \b ECAP_EVENT_1 - SOC trigger interrupt source is period match
//! \b ECAP_EVENT_2 - SOC trigger interrupt source is compare match
//! \b ECAP_EVENT_3 - SOC trigger interrupt source is period or compare match
//! \b ECAP_EVENT_4 - disabled
//! This function sets the eCAP event source for the SOC trigger trigger.
//! Valid values for \e event are \b ECAP_EVENT_1 to \b ECAP_EVENT_4.
//!
//! \return None.
//
//*****************************************************************************
static inline void ECAP_setSOCTriggerSource(uint32_t base, ECAP_Events event)
{
    ASSERT(ECAP_isBaseValid(base));

    //
    // Write to ECCTL0 - SOC event selection
    //
    HWREG(base + ECAP_O_ECCTL0) =
               ((HWREG(base + ECAP_O_ECCTL0) & ~ECAP_ECCTL0_SOCEVTSEL_M) |
                ((uint32_t)event << ECAP_ECCTL0_SOCEVTSEL_S));
}
//*****************************************************************************
//
//! Resets eCAP counters and flags.
//!
//! \param base is the base address of the ECAP module.
//!
//! This function resets the main counter (TSCTR register), event filter,
//! modulo counter, capture events and counter overflow flags
//!
//! \return None.
//
//*****************************************************************************
static inline void ECAP_resetCounters(uint32_t base)
{
    ASSERT(ECAP_isBaseValid(base));

    //
    // Write to ECCTL2
    //
    HWREGH(base + ECAP_O_ECCTL2) |= ECAP_ECCTL2_CTRFILTRESET;
}
//*****************************************************************************
//
//! Sets the eCAP DMA source.
//!
//! \param base is the base address of the ECAP module.
//! \param event is the eCAP event for the DMA
//!
//! This function sets the eCAP event source in capture mode and APWM mode
//! for the DMA trigger.
//! Valid values for \e event are \b ECAP_EVENT_1 to \b ECAP_EVENT_4.
//!
//! In capture mode of operation -
//! \b ECAP_EVENT_1 - DMA interrupt source is CEVT1
//! \b ECAP_EVENT_2 - DMA interrupt source is CEVT2
//! \b ECAP_EVENT_3 - DMA interrupt source is CEVT3
//! \b ECAP_EVENT_4 - DMA interrupt source is CEVT4
//!
//! In APWM mode of operation -
//! \b ECAP_EVENT_1 - DMA interrupt source is period match
//! \b ECAP_EVENT_2 - DMA interrupt source is compare match
//! \b ECAP_EVENT_3 - DMA interrupt source is period or compare match
//! \b ECAP_EVENT_4 - disabled
//!
//! \return None.
//
//*****************************************************************************
static inline void ECAP_setDMASource(uint32_t base, ECAP_Events event)
{
    ASSERT(ECAP_isBaseValid(base));

    //
    // Write to ECCTL2
    //
    HWREGH(base + ECAP_O_ECCTL2) =
               ((HWREGH(base + ECAP_O_ECCTL2) & ~ECAP_ECCTL2_DMAEVTSEL_M) |
                ((uint16_t)event << ECAP_ECCTL2_DMAEVTSEL_S));
}
//*****************************************************************************
//
//! Return the Modulo counter status.
//!
//! \param base is the base address of the ECAP module.
//!
//! This function returns the modulo counter status, indicating which register
//! gets loaded on the next capture event.
//!
//! \return Returns an \b ECAP_EVENT_n value indicating that CAPn is the
//! register to be loaded on the next event.
//
//*****************************************************************************
static inline ECAP_Events ECAP_getModuloCounterStatus(uint32_t base)
{
    uint16_t counterStatusValue;

